from maxo.enums.chat_admin_permission import ChatAdminPermission
from maxo.enums.update_type import UpdateType
from maxo.errors import AttributeIsEmptyError
from maxo.omit import Omittable, Omitted, is_defined
from maxo.types.base import MaxUpdate
from maxo.types.facades.chat import ChatMethodsFacade


class BotAdminPermissionsChanged(MaxUpdate, ChatMethodsFacade):
    """
    Вы получите это событие при изменении прав бота-администратора группового чата или канала. Событие возвращается пока только через Webhook - для Long Polling не поддержано

    Args:
        bot_id: Идентификатор бота, чьи права администратора были изменены
        chat_id: Идентификатор группового чата или канала, в котором изменились права бота-администратора
        is_admin: Признак того, является ли бот администратором канала или группового чата или нет
        is_channel: Признак того, что событие произошло в канале
        permissions: Перечень обновлённых прав доступа бота - администратора группового чата или канала. Ниже приведено краткое описание всех прав - подробнее читайте [в разделе «Доступные права администратора»](https://dev.max.ru/docs-api/methods/POST/chats/-chatId-/members/admins)
            **Краткое описание доступных прав бота-администратора**:
            - `read_all_messages` - читать все сообщения в канале или групповом чате
            - `edit` - редактировать посты и комментарии в каналах (для групповых чатов недоступно). Ранее вместо `edit` в API использовалось `edit_message` - в ответе могут возвращаться оба значения
            - `delete` - удалять посты и комментарии в каналах (для групповых чатов недоступно). Ранее вместо `delete` в API использовалось `delete_message` - в ответе могут возвращаться оба значения
            - `write` - редактировать и удалять сообщения в групповых чатах, а также писать посты и комментарии в каналах. Ранее вместо `write` в API использовалось `post_edit_delete_message` - в ответе могут возвращаться оба значения
            - `pin_message` - закреплять сообщение
            - `change_chat_info` - изменять информацию о канале или групповом чате
            - `add_remove_members` - добавлять и удалять участников группового чата. Добавление подписчиков в канал ботам недоступно
            - `add_admins` - добавлять и удалять администраторов группового чата или канала
            - `edit_link` - изменять ссылку на групповой чат (для каналов недоступно)
            - `can_call` - звонить в групповом чате (для каналов недоступно)
        type:
        user_id: Идентификатор пользователя или бота, который изменил права администратора
    """

    type = UpdateType.BOT_ADMIN_PERMISSIONS_CHANGED

    bot_id: int
    """Идентификатор бота, чьи права администратора были изменены"""
    chat_id: int
    """Идентификатор группового чата или канала, в котором изменились права бота-администратора"""
    is_admin: bool
    """Признак того, является ли бот администратором канала или группового чата или нет"""
    is_channel: bool
    """Признак того, что событие произошло в канале"""
    user_id: int
    """Идентификатор пользователя или бота, который изменил права администратора"""

    permissions: Omittable[list[ChatAdminPermission] | None] = Omitted()
    """
    Перечень обновлённых прав доступа бота - администратора группового чата или канала. Ниже приведено краткое описание всех прав - подробнее читайте [в разделе «Доступные права администратора»](https://dev.max.ru/docs-api/methods/POST/chats/-chatId-/members/admins)

    **Краткое описание доступных прав бота-администратора**:
        - `read_all_messages` - читать все сообщения в канале или групповом чате
        - `edit` - редактировать посты и комментарии в каналах (для групповых чатов недоступно). Ранее вместо `edit` в API использовалось `edit_message` - в ответе могут возвращаться оба значения
        - `delete` - удалять посты и комментарии в каналах (для групповых чатов недоступно). Ранее вместо `delete` в API использовалось `delete_message` - в ответе могут возвращаться оба значения
        - `write` - редактировать и удалять сообщения в групповых чатах, а также писать посты и комментарии в каналах. Ранее вместо `write` в API использовалось `post_edit_delete_message` - в ответе могут возвращаться оба значения
        - `pin_message` - закреплять сообщение
        - `change_chat_info` - изменять информацию о канале или групповом чате
        - `add_remove_members` - добавлять и удалять участников группового чата. Добавление подписчиков в канал ботам недоступно
        - `add_admins` - добавлять и удалять администраторов группового чата или канала
        - `edit_link` - изменять ссылку на групповой чат (для каналов недоступно)
        - `can_call` - звонить в групповом чате (для каналов недоступно)
    """

    @property
    def unsafe_permissions(self) -> list[ChatAdminPermission]:
        if is_defined(self.permissions):
            return self.permissions

        raise AttributeIsEmptyError(
            obj=self,
            attr="permissions",
        )
